Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Add the `agroal` extension plus one of `jdbc-db2`, `jdbc-derby`, `jdbc-h2`, `jdbc-mariadb`, `jdbc-mssql`, `jdbc-mysql`, `jdbc-oracle` or `jdbc-postgresql`.
ja_jp: `agroal` のエクステンションに加えて、 `jdbc-db2`、 `jdbc-derby`、 `jdbc-h2`、 `jdbc-mariadb`、 `jdbc-mssql`、 `jdbc-mysql`、 `jdbc-postgresql` のいずれかを追加します。

source: Add the `jacoco` gradle plugin
ja_jp: `jacoco` gradleプラグインの追加

source: Add the `quarkus-jacoco-deployment` dependency with the `test` scope.
ja_jp: `test` スコープで `quarkus-jacoco-deployment` 依存関係を追加します。

source: Add the `quarkus-jacoco-deployment` dependency with the test scope.
ja_jp: テストスコープで `quarkus-jacoco-deployment` 依存関係を追加します。

source: Add the code in the language folder (it is recommended to at least provide java and kotlin). *You have to use `org.acme` as the package name: <<org-acme-package>>*. It is possible to use <<qute-templates>> if needed.
ja_jp: コードを言語フォルダに追加します（少なくともjavaとkotlinを用意することをお勧めします）。 *パッケージ名: <<org-acme-package>>*. として `org.acme` を使用する必要があります* 。必要であれば <<qute-templates>> を使用することも可能です。

source: Add the codestart binding in the extension metadata `runtime/src/main/resources/META-INF/quarkus-extension.yaml`. *Without this, your codestart won't be added when your extension is picked*:
ja_jp: エクステンションメタデータ `runtime/src/main/resources/META-INF/quarkus-extension.yaml` に Codestart バインディングを追加します。 *これがないと、エクステンションが選択されたときに Codestart が追加されません* :

source: Add the correct JDBC extension for the database of your choice.
ja_jp: 選択したデータベースの正しい JDBC エクステンションを追加します。

source: Add the correct reactive extension for the database of your choice.
ja_jp: 選択したデータベースの正しいリアクティブエクステンションを追加します。

source: Add the correct reactive extension for the database you are using: `reactive-db2-client`, `reactive-mssql-client`, `reactive-mysql-client`, `reactive-oracle-client`, or `reactive-pg-client`.
ja_jp: 使用しているデータベースに適切なリアクティブエクステンションを追加します。 `reactive-pg-client` , `reactive-mysql-client`、または `reactive-db2-client` です。

source: Add the corresponding extension to your application:
ja_jp: 対応するエクステンションをアプリケーションに追加します:

source: Add the definite article “the” and “Quarkus” before the title of the guide, unless the word “Quarkus" is already in the title.
ja_jp: ガイドのタイトルに Quarkus という単語がすでに含まれていない限り、ガイドのタイトルの前に定冠詞 the と Quarkus を追加します。

source: Add the definite article “the” before the section title and specify “section” directly after the title.
ja_jp: セクションタイトルの前に定冠詞 the を追加し、タイトルの直後に section を指定します。

source: Add the extension by running this command:
ja_jp: このコマンドを実行してエクステンションを追加:

source: Add the extension to your project using following command (from your project directory):
ja_jp: （プロジェクトディレクトリで）以下のコマンドを使用して、エクステンションをプロジェクトに追加します：

source: Add the extension with:
ja_jp: 以下のコマンドでエクステンションを追加します。

source: Add the following *inside* the `quarkusapp` class body.
ja_jp: `quarkusapp` クラスの *内側に* 以下を追加します。

source: Add the following Maven Dependency:
ja_jp: 以下の Maven 依存関係を追加します。

source: Add the following Maven dependency:
ja_jp: 以下の Maven 依存関係を追加します。

source: Add the following SQL statements:
ja_jp: 以下の SQL ステートメントを追加します。

source: Add the following action script to it:
ja_jp: そこに次のアクションスクリプトを追加します。

source: Add the following annotation to any class in your integration tests to run the tests on both the JVM and native executables:
ja_jp: JVM とネイティブ実行可能ファイルの両方でテストを実行するには、統合テストの任意のクラスに次のアノテーションを追加します。

source: Add the following code into the `CoffeeRepositoryService` bean, so that we can demonstrate a circuit breaker in action:
ja_jp: 次のコードを `CoffeeRepositoryService` ビーンに追加して、サーキットブレーカーの動作をデモできるようにします。 :

source: Add the following configuration to your `application.properties`:
ja_jp: `application.properties` に次の設定を追加します:

source: Add the following contents to the Markdown redirection file:
ja_jp: Markdownリダイレクトファイルに、以下の内容を追加します:

source: Add the following dependencies to the project to support OIDC token propagation and REST clients:
ja_jp: OIDC トークンの伝播と REST クライアントをサポートするために、以下の依存関係をプロジェクトに追加します：

source: Add the following dependencies to your project:
ja_jp: 以下の依存関係をプロジェクトに追加してください:

source: Add the following dependencies to your test project:
ja_jp: テストプロジェクトに以下の依存関係を追加します。

source: Add the following dependency to your build file:
ja_jp: ビルドファイルに以下の依存関係を追加します。

source: Add the following dependency:
ja_jp: 次の依存関係を追加します。

source: Add the following import to your build file:
ja_jp: 次のインポートをビルドファイルに追加します:

source: Add the following imports to the `src/main/java/org/acme/VertxResource.java` file:
ja_jp: `src/main/java/org/acme/VertxResource.java` ファイルに次のimportを追加します:

source: Add the following in your constructor:
ja_jp: コンストラクターに以下を追加します。

source: Add the following method to the `VertxResource` class:
ja_jp: `VertxResource` クラスに以下のメソッドを追加します。

source: Add the following properties to `application.properties` to configure access to a local PostgreSQL instance.
ja_jp: `application.properties` に以下のプロパティを追加して、ローカルの PostgreSQL インスタンスへのアクセスを設定します。

source: Add the following properties to connect to Infinispan Server:
ja_jp: Infinispan Server に接続するために、以下のプロパティを追加して下さい:

source: Add the following property to your `application.properties`:
ja_jp: 次のプロパティーを `application.properties` に追加します。

source: Add the following specific annotation on any class in your integration tests for running integration tests in both JVM or native executables:
ja_jp: JVM とネイティブ実行可能ファイルの両方で統合テストを実行するために、結合テストの任意のクラスに以下の特定のアノテーションを追加します：

source: Add the following to our `FilmResource` class:
ja_jp: `FilmResource` のクラスに以下を追加します。

source: Add the following to your build file:
ja_jp: 以下をビルドファイルに追加してください:

source: Add the integration tests before you run your application in production mode.
ja_jp: アプリケーションを実稼働モードで動作させる前に、統合テストを追加してみましょう。

source: Add the link to the web component source (`js`) file in `deployment/src/main/resources/dev-ui/`. This has to take the format of qwc-extensionname-pagename.js
ja_jp: `deployment/src/main/resources/dev-ui/` にある Web コンポーネントのソース (`js`) ファイルへのリンクを追加します。これは qwc-extensionname-pagename.js の形式である必要があります。

source: Add the optional dependency as a non-optional dependency of your project.
ja_jp: オプションの依存関係を、プロジェクトの非オプションの依存関係として追加する。

source: Add the permission `see` and the action `all` to the `SecurityIdentity` instance of the `user` role. Similarly, for the `@PermissionsAllowed` annotation, `io.quarkus.security.StringPermission` is used by default.
ja_jp: `user` ロールの `SecurityIdentity` インスタンスに、権限 `see` とアクション `all` を追加します。 同様に、 `@PermissionsAllowed` アノテーションの場合は、デフォルトで `io.quarkus.security.StringPermission` が使用されます。

source: Add the readme <<readme-md>> section template in `base/README.tpl.qute.md`:
ja_jp: <<readme-md>> `base/README.tpl.qute.md` のセクションテンプレートに readme を追加します:

source: Add the readme <<readme-md>> section template.
ja_jp: readme <<readme-md>> セクションのテンプレートを追加します

source: Add the readme xref:readme-md[README.md] section template in `base/README.tpl.qute.md`:
ja_jp: `base/README.tpl.qute.md` にreadme xref:readme-md[README.md] のセクションテンプレートを追加します:

source: Add the required dependencies to your `pom.xml`
ja_jp: 必要な依存関係を `pom.xml` に追加します

source: Add the required dependencies to your build file
ja_jp: 必要な依存関係を `pom.xml` に追加します

source: Add the title as a top-level heading.
ja_jp: タイトルを最上位の見出しとして追加します。

source: Add this dependency to the `integration-tests`:
ja_jp: この依存関係を `integration-tests` に追加します。

source: Add this dependency to your `pom.xml`:
ja_jp: この依存関係を `pom.xml` に追加してください:

source: Add this dependency to your build file:
ja_jp: この依存関係をビルドファイルに追加してください:

source: Add this dependency:
ja_jp: 次の依存関係を追加します。

source: Add this extension to your build file as the following snippet illustrates:
ja_jp: 以下のスニペットのように、このエクステンションをビルドファイルに追加してください:

source: Add this to the `StarWarsResource` created earlier:
ja_jp: これを先ほど作成した `StarWarsResource` に追加します:

source: Add trace IDs into log message.
ja_jp: ログメッセージにトレースIDを追加します。

source: Add tracing information into log message.
ja_jp: ログメッセージにトレース情報を追加します。

source: Add tracing information into log messages.
ja_jp: ログメッセージにトレース情報を追加する。

source: Add your domain and return URL (set to `<host>/_renarde/security/oidc-success`) and press `Next`:
ja_jp: ドメインを追加して URL (`<host>/_renarde/security/oidc-success` に設定) を返し、 `Next` を押します。

source: Add your domain and return URL (set to `<host>/apple`) and press `Next`:
ja_jp: ドメインを追加して URL に戻り (`<host>/apple` に設定)、 `Next` を押します。

source: Adding Eyecandy to your Quarkus App with React and Patternfly
ja_jp: ReactとPatternflyでQuarkusアプリにEyecandyを追加する

source: Adding InMemory `FileItem` to `ClientMultipartForm`
ja_jp: `ClientMultipartForm` に InMemory `FileItem` の追加

source: Adding Ingress rules
ja_jp: Ingressルールの追加

source: Adding JReleaser
ja_jp: JReleaser の追加

source: Adding Jakarta Persistence extension to existing project
ja_jp: 既存のプロジェクトに Jakarta Persistence エクステンションを追加する

source: Adding MicroProfile OpenAPI Annotations
ja_jp: MicroProfile OpenAPIアノテーションの追加

source: Adding OpenAPI and Swagger UI
ja_jp: OpenAPI と Swagger UI の追加

source: Adding OpenAPI and Swagger-UI
ja_jp: OpenAPIとSwagger-UIの追加

source: Adding Pages to the Dev UI
ja_jp: Dev UI へのページの追加

source: Adding Resiliency: Circuit Breaker
ja_jp: レジリエンスの追加: サーキットブレーカー

source: Adding Resiliency: Fallbacks
ja_jp: レジリエンスの追加: フォールバック

source: Adding Resiliency: Rate Limits
ja_jp: レジリエンスの追加: 流量制御

source: Adding Resiliency: Retries
ja_jp: レジリエンスの追加: リトライ

source: Adding Resiliency: Timeouts
ja_jp: レジリエンスの追加: タイムアウト

source: Adding `@PreAuthorize("denyAll()")` to a method will ensure that method is not accessible by any user. Adding it to a class will ensure that all public methods of the class that are not annotated with any other Spring Security annotation will not be accessible to any user.
ja_jp: メソッドに `@PreAuthorize("denyAll()")` を追加すると、そのメソッドがどのユーザーからもアクセスできないようになります。クラスにこれを追加すると、クラスの他のSpring Securityアノテーションが付けられていないすべてのパブリックメソッドは、どのユーザーからもアクセスできないようになります。

source: Adding `@PreAuthorize("denyAll()")` to a method will ensure that that method is not accessible by any user. Adding it to a class will ensure that all public methods of the class that are not annotated with any other Spring Security annotation will not be accessible to any user.
ja_jp: メソッドに `@PreAuthorize("denyAll()")` を追加すると、どのユーザーもそのメソッドにアクセスできないようになります。これをクラスに追加すると、他の Spring Security アノテーションが付けられていないクラスのすべてのパブリックメソッドにどのユーザーもアクセスできないようになります。

source: Adding `@PreAuthorize("permitAll()")` to a method will ensure that method is accessible by any user (including anonymous users). Adding it to a class will ensure that all public methods of the class that are not annotated with any other Spring Security annotation will be accessible.
ja_jp: メソッドに `@PreAuthorize("permitAll()")` を追加すると、そのメソッドはどのユーザー（匿名ユーザーを含む）からもアクセスできるようになります。クラスにこれを追加すると、クラスの他のSpring Securityアノテーションが付けられていないすべてのパブリックメソッドに確実にアクセスできるようになります。

source: Adding `@PreAuthorize("permitAll()")` to a method will ensure that that method is accessible by any user (including anonymous users). Adding it to a class will ensure that all public methods of the class that are not annotated with any other Spring Security annotation will be accessible.
ja_jp: メソッドに `@PreAuthorize("permitAll()")` を追加すると、すべてのユーザー (匿名ユーザーを含む) がそのメソッドにアクセスできるようになります。これをクラスに追加すると、他の Spring Security アノテーションが付けられていないクラスのすべてのパブリックメソッドにアクセスできるようになります。

source: Adding a Public Key
ja_jp: 公開鍵の追加

source: Adding a `%prod.` profile prefix to `quarkus.oidc.auth-server-url` ensures that `Dev Services for Keycloak` launches a container for you when the application is run in dev or test modes. For more information, see the <<oidc-client-keycloak-dev-mode,Running the application in dev mode>> section.
ja_jp: `quarkus.oidc.auth-server-url` に `%prod.` プロファイル接頭辞を追加すると、アプリケーションが開発モードまたはテストモードで実行されているときに、 `Dev Services for Keycloak` がコンテナーを起動するようになります。 詳細は、<<oidc-client-keycloak-dev-mode,Running the application in dev mode>> セクションを参照してください。

source: Adding a `%prod.` profile prefix to `quarkus.oidc.auth-server-url` ensures that `Dev Services for Keycloak` will launch a container for you when the application is run in a dev mode. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information.
ja_jp: `quarkus.oidc.auth-server-url` に `%prod.` プロファイルのプレフィックスを追加すると、アプリケーションが開発モードで実行されたときに `Dev Services for Keycloak` がコンテナを起動するようになります。詳しくは、後述の link:#keycloak-dev-mode[開発モードでのアプリケーションの実行] をご覧ください。

source: Adding a `%prod.` profile prefix to `quarkus.oidc.auth-server-url` ensures that `Dev Services for Keycloak` will launch a container for you when the application is run in a dev mode. See xref:keycloak-dev-mode[Running the Application in Dev mode] section below for more information.
ja_jp: `quarkus.oidc.auth-server-url` に `%prod.` プロファイルプレフィックスを追加することで、アプリケーションを dev モードで実行する際に `Dev Services for Keycloak` がコンテナを起動するようになります。詳しくは、以下の xref:keycloak-dev-mode[Devモードでアプリケーションを実行] セクションを参照してください。

source: Adding a `%prod.` profile prefix to `quarkus.oidc.auth-server-url` ensures that `Dev Services for Keycloak` will launch a container for you when the application is run in dev or test modes. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information.
ja_jp: `quarkus.oidc.auth-server-url` に `%prod.` プロファイル接頭辞を追加すると、アプリケーションが開発モードまたはテストモードで実行されているときに、 `Dev Services for Keycloak` がコンテナーを起動するようになります。詳細については、以下の <<keycloak-dev-mode, 開発モードでのアプリケーションの実行>> セクションを参照してください。

source: Adding a `%prod.` profile prefix to `quarkus.oidc.auth-server-url` ensures that `Dev Services for Keycloak` will launch a container for you when the application is run in dev or test modes. See xref:keycloak-dev-mode[Running the Application in Dev mode] section below for more information.
ja_jp: `quarkus.oidc.auth-server-url` に `%prod.` プロファイルプレフィックスを追加することで、アプリケーションを dev または test モードで実行する際に、 `Dev Services for Keycloak` がコンテナを起動するようになります。詳しくは、以下の xref:keycloak-dev-mode[Devモードでアプリケーションを実行] セクションを参照してください。

source: Adding a public key
ja_jp: 公開鍵の追加

source: Adding a readiness health check procedure
ja_jp: readiness ヘルスチェックプロシージャの追加

source: Adding a startup health check procedure
ja_jp: スタートアップヘルスチェックプロシージャの追加

source: Adding additional methods to the generated resource
ja_jp: 生成されたリソースへの追加メソッドの追加

source: Adding custom JavaScript policies
ja_jp: カスタム JavaScript ポリシーの追加

source: Adding custom queries with parameters is as easy as providing your query string to the `@Query` annotation.
ja_jp: パラメーター付きのカスタムクエリーの追加は、 `@Query` アノテーションにクエリー文字列を提供するのと同様に簡単です。

source: Adding distributions to the release
ja_jp: リリースへのディストリビューションの追加

source: Adding entity methods
ja_jp: エンティティメソッドの追加

source: Adding extension(s)
ja_jp: エクステンションの追加

source: Adding extensions
ja_jp: エクステンションの追加

source: Adding extensions to an existing project
ja_jp: 既存のプロジェクトにエクステンションを追加する

source: Adding external JARs to the indexer with IndexDependencyBuildItem
ja_jp: IndexDependencyBuildItem によるインデクサへの外部 JAR の追加

source: Adding full pages
ja_jp: フルページの追加

source: Adding full text capabilities to our REST service
ja_jp: RESTサービスに全文検索機能を追加

source: Adding headers with quarkus.http.header
ja_jp: quarkus.http.headerによるヘッダーの追加

source: Adding labels
ja_jp: ラベルの追加

source: Adding new events
ja_jp: 新しいイベントの追加

source: Adding persistence
ja_jp: 永続性の追加

source: Adding plugins
ja_jp: プラグインの追加

source: Adding something to the footer works exactly like adding a Card, except you use a `FooterPageBuildItem` rather than a `CardPageBuildItem`.
ja_jp: フッターに何かを追加する方法はカードを追加する方法と同じですが、 `CardPageBuildItem` ではなく `FooterPageBuildItem` を使用する点のみ異なります。

source: Adding something to the section menu works exactly like adding a Card, except you use a `MenuPageBuildItem` rather than a `CardPageBuildItem`.
ja_jp: セクションメニューに何かを追加する方法はカードを追加する方法と同じですが、 `CardPageBuildItem` ではなく `MenuPageBuildItem` を使用する点のみ異なります。

source: Adding tests
ja_jp: テストの追加

source: Adding the Infinispan client extension
ja_jp: Infinispanクライアントエクステンションの追加

source: Adding the OpenShift extension
ja_jp: OpenShiftエクステンションの追加

source: Adding the `%prod.` profile prefix to `quarkus.oidc.auth-server-url` ensures that Dev Services for Keycloak automatically launches a container in development mode. For more details, see the <<keycloak-dev-mode,Running the application in Dev mode>> section.
ja_jp: `quarkus.oidc.auth-server-url` に `%prod.` プロファイルプレフィックスを追加すると、Dev Services for Keycloak が開発モードで自動的にコンテナーを起動するようになります。 詳細は、<<keycloak-dev-mode,Running the application in Dev mode>> セクションを参照してください。

source: Adding the `quarkus.keycloak.devservices.java-opts=-XX:UseSVE=0` configuration property may help to workaround Keycloak Dev Services startup problems on some Mac OS systems.
ja_jp: `quarkus.keycloak.devservices.java-opts=-XX:UseSVE=0` 設定プロパティーを追加すると、一部の Mac OS システムで Keycloak Dev Services の起動問題の回避策として役立つ場合があります。

source: Adding the container image extension
ja_jp: コンテナーイメージエクステンションの追加

source: Adding the url of the external link (in this case, we use `NonApplicationRootPathBuildItem` to create this link, as this link is under the configurable non-application path, default `/q`). Always use `NonApplicationRootPathBuildItem` if your link is available under `/q`.
ja_jp: 外部リンクの URL を追加します。ここでは、リンクが設定可能な非アプリケーションパス (デフォルトは `/q`) の下にあるため、 `NonApplicationRootPathBuildItem` を使用してリンクを作成します。リンクが `/q` の下にある場合は、必ず `NonApplicationRootPathBuildItem` を使用します。

source: Adding user-specific data to the health check response
ja_jp: ヘルスチェックのレスポンスにユーザー固有のデータを追加

source: Additional Config Sources
ja_jp: その他の設定ソース

source: Additional Features
ja_jp: 追加機能

source: Additional HTTP Headers
ja_jp: 追加の HTTP ヘッダー

source: Additional HTTP Headers per path
ja_jp: パスごとの追加の HTTP ヘッダー

source: Additional Improvements
ja_jp: その他の改善点

source: Additional Information
ja_jp: 追加情報

source: Additional JEPs are planned for OpenJDK 26 and beyond.
ja_jp: 追加の JEP は OpenJDK 26 以降で計画されています。

source: Additional JWT Authentication options
ja_jp: 追加の JWT 認証オプション

source: Additional JWT authentication options
ja_jp: JWT 認証の追加オプション

source: Additional Notes
ja_jp: その他の注意事項

source: Additional Propagators
ja_jp: 追加プロパゲーター

source: Additional Quarkus resources for OIDC authentication
ja_jp: OIDC 認証のための追加の Quarkus リソース

source: Additional Redis commands
ja_jp: 追加のRedisコマンド

source: Additional Resources
ja_jp: 関連リソース

source: Additional SmallRye JWT configuration
ja_jp: 追加の SmallRye JWT 設定

source: Additional `SecurityIdentity` instances can be accessed as a `quarkus.security.identities` attribute on the first `SecurityIdentity`, however, accessing these extra identities directly may not be necessary, for example, when both <<mutual-tls>> and xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer authentication] mechanisms have been combined and done their authentications, the authenticated bearer token can be injected as a token credential alongside `SecurityIdentity` created by <<mutual-tls>>. This is exemplified below:
ja_jp: 追加の `SecurityIdentity` インスタンスには、最初の `SecurityIdentity` の `quarkus.security.identities` 属性としてアクセスできます。しかし、これらの追加のアイデンティティーに直接アクセスする必要がない場合があります。たとえば、<<mutual-tls>> と xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラー認証] メカニズムの両方が組み合わされて認証が行われている場合、認証されたベアラートークンは、<<mutual-tls>> によって作成された `SecurityIdentity` とともにトークン認証情報として注入できます。以下に例を示します。

source: Additional ``ConfigSource``s
ja_jp: 追加 ``ConfigSource``

source: Additional ``Converter``s
ja_jp: 追加 ``Converter``

source: Additional block.
ja_jp: 追加ブロック。

source: Additional component classes can be set using `@QuarkusComponentTest#value()` or `QuarkusComponentTestExtensionBuilder#addComponentClasses()`.
ja_jp: 追加のコンポーネントクラスは、 `@QuarkusComponentTest#value()` または `QuarkusComponentTestExtensionBuilder#addComponentClasses()` を使用して設定できます。

source: Additional components can be registered manually via `EngineBuilder` methods in a CDI observer method at runtime:
ja_jp: 追加のコンポーネントは、実行時に CDI オブザーバーメソッドの `EngineBuilder` メソッドを使用して手動で登録できます。

source: Additional configuration
ja_jp: 追加設定

source: Additional dependency to enable Hibernate Envers
ja_jp: Hibernate Enversを有効にするための追加の依存関係

source: Additional dependency to enable Hibernate Spatial
ja_jp: Hibernate Spatial を有効にするための追加の依存関係

source: Additional examples and integration guides
ja_jp: 追加の例と統合ガイド

source: Additional exporters will be available in the Quarkiverse https://docs.quarkiverse.io/quarkus-opentelemetry-exporter/dev/index.html[quarkus-opentelemetry-exporter] project.
ja_jp: Quarkiverse https://docs.quarkiverse.io/quarkus-opentelemetry-exporter/dev/index.html[quarkus-opentelemetry-exporter] プロジェクトで、追加のエクスポーターを使用できるようになる予定です。

source: Additional exporters will be available in the Quarkiverse https://github.com/quarkiverse/quarkus-opentelemetry-exporter/blob/main/README.md[quarkus-opentelemetry-exporter] project.
ja_jp: 追加のエクスポーターは、Quarkiverseの link:https://github.com/quarkiverse/quarkus-opentelemetry-exporter/blob/main/README.md[quarkus-opentelemetry-exporter] プロジェクトで利用できるようになる予定です。

source: Additional flags applied by Quarkus
ja_jp: Quarkusで適用される追加フラグ

source: Additional information about lifecycle events or events not tied to specific requests, useful for debugging.
ja_jp: ライフサイクルイベントまたは特定のリクエストに関連付けられていないイベントに関する追加情報。デバッグに役立ちます。

source: Additional information on which classes are initialized and why can be obtained by passing in the `-H:+PrintClassInitialization` flag via `-Dquarkus.native.additional-build-args`.
ja_jp: どのクラスがどのように初期化されるかについての追加情報は、 `-Dquarkus.native.additional-build-args` を通じて `-H:+PrintClassInitialization` フラグを渡すことで得ることができます。

source: Additional information:
ja_jp: 追加情報

source: Additional instrumentation
ja_jp: 追加の計器

source: Additional notes on @ConfigProperties
ja_jp: @ConfigProperties に関する追加の注意事項

source: Additional options are available:
ja_jp: 以下に示すその他のオプションも利用できます。

source: Additional properties, such as:
ja_jp: 次のような追加のプロパティー:

source: Additional references
ja_jp: 参考文献

source: Additional requirements for client SSL
ja_jp: クライアントSSLの追加要件

source: Additional resources
ja_jp: 関連情報

source: Additional response body parameter types
ja_jp: 追加のレスポンス本文パラメータータイプ

source: Additional set `-Djavax.net.ssl.trustStorePassword=changeit` if your `cacerts` file is password protected.
ja_jp: `cacerts` ファイルがパスワードで保護されている場合は、追加で `-Djavax.net.ssl.trustStorePassword=changeit` を設定してください。

source: Additional the native images startup in less than 1 second, down from 10+ seconds in some cases.
ja_jp: 追加されたネイティブイメージの起動時間は1秒未満で、それまで10秒以上かかっていたものが短縮されました。

source: Additionally a custom `SecurityIdentityAugmentor` can also be used to add the roles as documented xref:security.adoc#security-identity-customization[here].
ja_jp: さらに、カスタム `SecurityIdentityAugmentor` を使用して、xref:security.adoc#security-identity-customization[ここ] に文書化されているようにロールを追加することもできます。

source: Additionally it provides `JWT Generation API` for creating `signed`, `inner-signed` and/or `encrypted` `JWT` tokens with ease.
ja_jp: さらに、 `JWT Generation API` を提供して、 `signed` , `inner-signed` , および/または `encrypted` `JWT`トークンを簡単に作成することができます。

source: Additionally make sure that the `native-image-agent` goal is present in the `quarkus-maven-plugin` configuration:
ja_jp: さらに、 `quarkus-maven-plugin` 設定に `native-image-agent` ゴールが存在することを確認します。

source: Additionally make sure that the `quarkus:native-image-agent` goal is executed: it is part of the default lifecycle when using the `quarkus` packaging.
ja_jp: さらに、`quarkus:native-image-agent` ゴールが実行されていることを確認してください。これは `quarkus` パッケージングを使用する場合のデフォルトのライフサイクルの一部です。

source: Additionally to the default config locations, Quarkus provides a way to scan additional locations for configuration properties files.
ja_jp: Quarkus は、設定プロパティーファイルをデフォルトの設定場所だけでなく、別の場所でもスキャンするための方法を提供します。

source: Additionally, OpenShift cert-manager or Let's Encrypt does not typically provide JKS and remains PEM-only.
ja_jp: また、OpenShift cert-manager や Let’s Encrypt は、通常 JKS を提供せず、現在も PEM しか提供しません。
